test/stress-test.yml
config:
  target: "https://tune-teaser-server.onrender.com"
  phases:
    - duration: 20
      arrivalRate: 5
      rampTo: 10
  defaults:
    headers:
      x-my-service-auth: "987401838271002188298567"

scenarios:
  - name: "Create, Join and Play Game"
    engine: "socketio"
    flow:
      - get:
          url: "/api/playlists?country=us&locale=en"
      - emit:
          channel: "create_room"
          data:
            name: "TestRoom"
            roomId: "12"
      - think: 5
      - emit:
          channel: "join_room"
          data:
            name: "TestPlayer"
            roomId: "12"
      - think: 5
      - emit:
          channel: "pick_music"
          data:
            name: "TestPlayer"
            roomId: "12"
            gameMode: "Normal"
            songNumbers: "5"
      - think: 5
      - emit:
          channel: "picked_music_starting_game"
          data:
            roomId: "12"
            playlistId: "37i9dQZF1DWXti3N4Wp5xy"
      - think: 5
      - emit:
          channel: "start_game"
          data:
            roomId: "12"
      - think: 5
      - emit:
          channel: "room_game_init"
          data:
            roomId: "12"
      - think: 5
      - emit:
          channel: "chosen_answer"
          data:
            answerIndex: 1
            roomId: "12"
      - think: 5
      - emit:
          channel: "next_question"
          data:
            roomId: "12"
      - think: 5
      - emit:
          channel: "leave_room"
          data:
            roomId: "12"